results/test2/daphne-1000-requests-200-concurrency.txt
Summary:
  Total:	6.2803 secs
  Slowest:	2.2095 secs
  Fastest:	1.0065 secs
  Average:	1.3203 secs
  Requests/sec:	159.2288

  Total data:	11430 bytes
  Size/request:	18 bytes

Response time histogram:
  1.006 [1]	|
  1.127 [128]	|■■■■■■■■■■■■■■■■■■■
  1.247 [124]	|■■■■■■■■■■■■■■■■■■■
  1.367 [265]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.488 [54]	|■■■■■■■■
  1.608 [0]	|
  1.728 [0]	|
  1.849 [0]	|
  1.969 [0]	|
  2.089 [10]	|■■
  2.209 [53]	|■■■■■■■■


Latency distribution:
  10% in 1.0455 secs
  25% in 1.1491 secs
  50% in 1.2890 secs
  75% in 1.3353 secs
  90% in 2.0191 secs
  95% in 2.1712 secs
  99% in 2.1932 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.1010 secs, 1.0065 secs, 2.2095 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	1.2170 secs, 1.0064 secs, 1.4294 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	635 responses

Error distribution:
  [6]	Get "http://127.0.0.1:8000/": dial tcp 127.0.0.1:8000: connect: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55694->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55695->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55696->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55697->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55698->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55699->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55700->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55701->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55702->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55703->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55704->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55705->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55706->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55707->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55708->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55709->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55710->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55711->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55712->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55713->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55714->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55715->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55716->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55717->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55718->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55719->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55720->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55721->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55722->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55723->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55724->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55725->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55726->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55727->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55728->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55729->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55730->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55731->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55732->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55733->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55734->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55735->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55736->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55737->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55738->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55739->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55740->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55741->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55742->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55743->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55745->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55746->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55748->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55749->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55751->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55752->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55753->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55754->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55755->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55756->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55757->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55758->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55760->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55761->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55762->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55763->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55764->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55765->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55766->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55767->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55768->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55769->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55771->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55772->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55773->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55775->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55776->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55777->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55778->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55782->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55783->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55784->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55785->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55786->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55787->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55788->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55789->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55790->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55791->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55792->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55793->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55794->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55795->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55796->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55797->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55798->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55799->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55800->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55802->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55803->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55804->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55805->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55806->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55808->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55809->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55810->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55811->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55813->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55814->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55815->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55816->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55819->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55820->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55821->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55823->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55824->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55825->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55827->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55828->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55829->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55830->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55831->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55832->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55833->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55835->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55837->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55838->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55839->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55840->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55841->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55844->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55847->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55849->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55851->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55853->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55854->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55856->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55858->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55859->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55861->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55863->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55865->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55866->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55868->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55873->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55879->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55891->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55892->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55893->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55894->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55895->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55896->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55897->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55898->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55899->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55900->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55901->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55902->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55903->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55904->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55905->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55906->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55907->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55908->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55909->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55910->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55912->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55913->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55914->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55915->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55916->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55917->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55918->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55919->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55920->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55921->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55922->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55923->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55924->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55925->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55926->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55927->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55928->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55929->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55930->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55931->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55932->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55933->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55934->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55935->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55936->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55937->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55938->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55939->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55940->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55941->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55942->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55943->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55944->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55945->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55946->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55947->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55948->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55949->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55950->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55952->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55954->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55955->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55956->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55957->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55958->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55959->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55960->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55962->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55963->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55964->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55965->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55966->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55967->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55968->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55969->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55970->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55971->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55972->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55973->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55974->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55976->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55977->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55978->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55979->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55981->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55982->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55983->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55984->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55985->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55988->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55989->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55990->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55992->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55993->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55994->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55995->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55996->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55997->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:55998->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56000->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56001->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56002->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56003->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56004->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56005->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56006->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56007->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56009->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56010->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56011->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56020->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56026->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56027->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56031->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56037->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56038->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56039->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56040->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56041->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56043->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56045->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56046->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56047->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56049->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56050->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56051->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56052->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56053->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56054->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56055->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56056->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56059->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56060->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56061->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56062->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56063->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56064->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56065->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56066->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56067->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56068->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56069->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56070->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56071->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56072->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56073->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56074->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56075->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56076->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56077->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56078->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56079->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56080->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56083->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56084->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56085->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56087->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56088->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56089->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56090->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56091->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56094->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56095->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56097->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56098->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56101->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56102->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56103->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56104->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56105->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56108->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56109->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56112->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56113->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56115->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56117->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56121->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56154->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56156->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56157->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56158->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56164->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56165->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56167->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56168->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56169->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56170->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56171->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56172->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56173->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56175->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56182->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56185->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56195->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56199->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56205->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56206->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56222->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56225->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56229->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56230->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56232->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56234->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56235->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56236->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56238->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56239->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:56243->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": readLoopPeekFailLocked: read tcp 127.0.0.1:56107->127.0.0.1:8000: read: connection reset by peer
  [1]	Get "http://127.0.0.1:8000/": write tcp 127.0.0.1:56100->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://127.0.0.1:8000/": write tcp 127.0.0.1:56114->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://127.0.0.1:8000/": write tcp 127.0.0.1:56116->127.0.0.1:8000: write: broken pipe
  [1]	Get "http://127.0.0.1:8000/": write tcp 127.0.0.1:56119->127.0.0.1:8000: write: broken pipe